# St7GetTotalCreepDefinitions

Returns the total number and highest ID number of the creep laws in the specified model.

long St7GetTotalCreepDefinitions(long uID, long* NumSets, long* LastSet)
Input Parameters
uID
Strand7 model file ID.
Output Parameters
NumSets
The number of creep laws.
LastSet
The highest creep definition ID.